#pragma once

// Name: BS, Version: 1.536.0

#ifdef _MSC_VER
	#pragma pack(push, 0x8)
#endif

namespace SDK
{
//---------------------------------------------------------------------------
// Script Structs
//---------------------------------------------------------------------------

// UserDefinedStruct ST_HullColorSet.ST_HullColorSet
// 0x0060
struct FST_HullColorSet
{
	struct FLinearColor                                MainHullColor_3_CB2FB2B541DCD2034104E2BB81D1C412;         // 0x0000(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                SecondaryHullColor_4_0784A7F64BD10BC34819E4B36880ECFD;    // 0x0010(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                DetailColor_6_77EE2E554EEC68D6CDB3EFAB3ECAF1E9;           // 0x0020(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                IneriorHullColor_22_078E84504B2AE6871BF53082302D0FDC;     // 0x0030(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                InteriorDetailColor_23_84FAA9E14242027884D22F8054083A60;  // 0x0040(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
	struct FLinearColor                                PaintColor_26_4DCB032F4CB8C08D9F13FFB22685F2E0;           // 0x0050(0x0010) (Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData)
};

}

#ifdef _MSC_VER
	#pragma pack(pop)
#endif
